# Excercices

## Exercice 1 : Creating and Modifying Series

Create a Pandas Series from a dictionary where keys are ['a', 'b', 'c'] and values are [100, 200, 300].

In [2]:
import pandas as pd
dict={'a': 100, 'b': 200, 'c': 300}
exo1_series = pd.Series(dict)
exo1_series

a    100
b    200
c    300
dtype: int64

## Exercice 2 : Creating DataFrames

Create a DataFrame from the following data:

In [ ]:
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [3]:
df_exo2 = pd.DataFrame({'A': [1, 4, 7], 'B': [2, 5, 8], 'C': [3, 6, 9]})
df_exo2

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

Modify the code to add a new column D with values [10, 11, 12].

In [5]:
df_exo2['D'] = [10, 11, 12]
df_exo2

   A  B  C   D
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12


Drop column B from the DataFrame and display the result.

In [8]:
df_exo2=df_exo2.drop(columns=['B'])
df_exo2

   A  C   D
0  1  3  10
1  4  6  11
2  7  9  12

## Exercice 3 : DataFrame Indexing and Selection

Select column B from the following DataFrame:

In [ ]:
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [9]:
df_exo3 = pd.DataFrame({'A': [1, 4, 7], 'B': [2, 5, 8], 'C': [3, 6, 9]})
colonneB = df_exo3['B']
colonneB

0    2
1    5
2    8
Name: B, dtype: int64

Modify the code to select both columns A and C.

In [15]:
colonnesAC=df_exo3[['A', 'C']]
colonnesAC

   A  C
0  1  3
1  4  6
2  7  9

Select the row with index 1 using the .loc method.

In [16]:
row_1 = df_exo3.loc[1]
row_1

A    4
B    5
C    6
Name: 1, dtype: int64

## Exercice 4 : Adding and Removing DataFrame Elements

Add a new column Sum to the DataFrame which is the sum of columns A, B, and C.

Remove the column Sum from the DataFrame.

Add a column Random with random numbers generated using numpy.

## Exercice 5 : Merging DataFrames

Merge the following two DataFrames on the key column:

In [ ]:
left:
   key  A  B
0    1  A1  B1
1    2  A2  B2
2    3  A3  B3

right:
   key  C  D
0    1  C1  D1
1    2  C2  D2
2    3  C3  D3

Modify the merge to use an outer join instead of an inner join.

Add a new column E to the right DataFrame and update the merge to include this new column.

## Exercice 6 : Data Cleaning

Replace all NaN values in the following DataFrame with the value 0:

In [ ]:
   A    B    C
0  1.0  NaN  3.0
1  NaN  5.0  6.0
2  7.0  8.0  NaN

Modify the code to replace NaN values with the mean of the column.

Drop rows where any value is NaN.

## Exercice 7 : Grouping and Aggregation

Group the following DataFrame by column Category and calculate the mean of column Value:

In [ ]:
   Category  Value
0         A      1
1         B      2
2         A      3
3         B      4
4         A      5
5         B      6

Modify the code to calculate the sum instead of the mean.

Group by Category and count the number of entries in each group.

## Exercice 8 : Pivot Tables

Create a pivot table from the following DataFrame, showing the mean Value for each Category and Type:

In [ ]:
   Category  Type  Value
0         A     X      1
1         A     Y      2
2         A     X      3
3         B     Y      4
4         B     X      5
5         B     Y      6

Modify the pivot table to show the sum of Value instead of the mean.

Add margins to the pivot table to show the total mean for each Category and Type.

## Exercice 9 : Time Series Data

Create a time series DataFrame with a date range starting from '2023-01-01' for 6 periods and random values.

Set the date column as the index of the DataFrame.

Resample the data to calculate the sum for each 2-day period.

## Exercice 10 : Handling Missing Data

Interpolate missing values in the following DataFrame:

In [ ]:
   A    B    C
0  1.0  NaN  3.0
1  2.0  5.0  NaN
2  NaN  8.0  9.0

Drop rows with any NaN values instead of interpolating.

## Exercice 11 : DataFrame Operations

Calculate the cumulative sum of the following DataFrame:

In [ ]:
   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

Calculate the cumulative product of the DataFrame.

Apply a function to subtract 1 from all elements in the DataFrame.